NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/gatt/src/mesh_gatt.c
/* Copyright (c) 2010 - 2018, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "mesh_gatt.h"

#include "nrf_mesh_gatt.h"
#if MESH_FEATURE_GATT_ENABLED

#include <stdint.h>
#include "ble_hci.h"
#include "ble_gatt.h"
#include "ble_gap.h"
#include "ble_gatts.h"
#include "ble_types.h"
#include "nrf_error.h"

#include "app_util.h"
#include "nordic_common.h"

#include "nrf_mesh_assert.h"
#include "packet_buffer.h"
#include "timer_scheduler.h"
#include "timer.h"

#define PROXY_SAR_TYPE_COMPLETE      (0)
#define PROXY_SAR_TYPE_FIRST_SEGMENT (1)
#define PROXY_SAR_TYPE_CONT_SEGMENT  (2)
#define PROXY_SAR_TYPE_LAST_SEGMENT  (3)

#define MESH_GATT_WRITE_OVERHEAD (3)
#define MESH_GATT_CONN_INDEX_INVALID (0xFFFF)

#define MESH_GATT_PDU_TYPE_MASK (0x3f)

typedef struct __attribute((packed))
{
    uint8_t pdu_type : 6;
    uint8_t sar_type : 2;
    uint8_t pdu[];
} mesh_gatt_proxy_pdu_t;

typedef struct __attribute((packed))
{
    nrf_mesh_tx_token_t token;
    uint8_t length;             /**< Length of the PDU. */
    uint8_t pdu[];
} mesh_gatt_proxy_buffer_t;

/*******************************************************************************
 * Internal static functions
 ******************************************************************************/

#if defined(UNIT_TEST) || defined(_lint)
extern mesh_gatt_t m_gatt;
#else
#include "nrf_sdh_ble.h"
static mesh_gatt_t m_gatt;
NRF_SDH_BLE_OBSERVER(m_gatt_obs, NRF_MESH_GATT_BLE_OBSERVER_PRIO, mesh_gatt_on_ble_evt, &m_gatt);
#endif

static uint8_t sar_type_get(uint8_t pdu_length, uint8_t offset, uint16_t mtu)
{
    if (offset == 0)
    {
        if (pdu_length <= mtu)
        {
            return PROXY_SAR_TYPE_COMPLETE;
        }
        else
        {
            return PROXY_SAR_TYPE_FIRST_SEGMENT;
        }
    }
    else
    {
        if ((pdu_length - offset) <= mtu)
        {
            return PROXY_SAR_TYPE_LAST_SEGMENT;
        }
        else
        {
            return PROXY_SAR_TYPE_CONT_SEGMENT;
        }
    }
}

static void mesh_gatt_pdu_send(uint16_t conn_index)
{
    mesh_gatt_connection_t * p_conn = &m_gatt.connections[conn_index];
    packet_buffer_packet_t * p_packet = p_conn->tx.transaction.p_curr_packet;
    NRF_MESH_ASSERT(p_packet != NULL);

    mesh_gatt_proxy_buffer_t * p_proxy_buffer = (mesh_gatt_proxy_buffer_t *) p_packet->packet;
    /* Ensure the offset is not larger than the PDU.  */
    NRF_MESH_ASSERT(p_conn->tx.transaction.offset < p_proxy_buffer->length);

    uint8_t sar_type = sar_type_get(p_proxy_buffer->length,
                                    p_conn->tx.transaction.offset,
                                    p_conn->effective_mtu);

    uint16_t length = 0;
    if (sar_type == PROXY_SAR_TYPE_FIRST_SEGMENT ||
        sar_type == PROXY_SAR_TYPE_CONT_SEGMENT)
    {
        length = p_conn->effective_mtu;
    }
    else if (sar_type == PROXY_SAR_TYPE_COMPLETE ||
             sar_type == PROXY_SAR_TYPE_LAST_SEGMENT)
    {
        length = p_proxy_buffer->length - p_conn->tx.transaction.offset;
    }

    NRF_MESH_ASSERT(length <= p_conn->effective_mtu);

    mesh_gatt_proxy_pdu_t * p_proxy_pdu =
        (mesh_gatt_proxy_pdu_t *) &p_proxy_buffer->pdu[p_conn->tx.transaction.offset];

    p_proxy_pdu->sar_type = sar_type;

    ble_gatts_hvx_params_t hvx_params;
    memset(&hvx_params, 0, sizeof(hvx_params));

    uint16_t hvx_length = length;
    hvx_params.handle = m_gatt.handles.tx.value_handle;
    hvx_params.p_data = (const uint8_t *) p_proxy_pdu;
    hvx_params.p_len  = &hvx_length;
    hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

    uint32_t err_code = sd_ble_gatts_hvx(p_conn->conn_handle, &hvx_params);

    /* There might be a system attributes missing event pending. Set it and try again. */
    if (err_code == BLE_ERROR_GATTS_SYS_ATTR_MISSING)
    {
        NRF_MESH_ERROR_CHECK(sd_ble_gatts_sys_attr_set(p_conn->conn_handle, NULL, 0, 0));
        err_code = sd_ble_gatts_hvx(p_conn->conn_handle, &hvx_params);
    }

    if (err_code == NRF_ERROR_INVALID_STATE)
    {
        /* If we're not able to transmit. The client might have disabled notifications. */
        (void) mesh_gatt_disconnect(conn_index);
    }
    else if (err_code == NRF_ERROR_RESOURCES)
    {
        /* Try again at the next TX_COMPLETE. */
    }
    else
    {
        /* If we are able to send, we should have sent the full length. */
        NRF_MESH_ASSERT(err_code == NRF_SUCCESS && hvx_length == length);

