NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/gatt/src/mesh_gatt.c
/*******************************************************************************
 * Event handlers
 ******************************************************************************/

static void write_evt_handle(const ble_evt_t * p_ble_evt)
{
    ble_gatts_evt_write_t const * p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;
    uint16_t conn_index = conn_handle_to_index(p_ble_evt->evt.gatts_evt.conn_handle);
    if (conn_index == MESH_GATT_CONN_INDEX_INVALID)
    {
        return;
    }

    if ((p_evt_write->handle == m_gatt.handles.tx.cccd_handle)
        && (p_evt_write->len == 2))
    {
        bool notification_enabled =
            (uint16_decode(p_evt_write->data) & BLE_GATT_HVX_NOTIFICATION) != 0;

        if (notification_enabled)
        {
            mesh_gatt_evt_t evt;
            evt.type = MESH_GATT_EVT_TYPE_TX_READY;
            evt.conn_index = conn_index;
            m_gatt.evt_handler(&evt, m_gatt.p_context);
        }
        else
        {
            /* The client disabled the notifications. This is sort of against the spec,
             * but we'll try to play nice and instead disconnect if we're trying to
             * write when in an invalid state. See handling of sd_ble_gatts_hvx() returns.
             */
        }

    }
    else if ((p_evt_write->handle == m_gatt.handles.rx.value_handle))
    {
        if (pdu_length_valid(&m_gatt.connections[conn_index], p_evt_write->len) &&
            pdu_type_valid(&m_gatt.connections[conn_index], p_evt_write->data[0] & MESH_GATT_PDU_TYPE_MASK))
        {
            if (rx_session_in_progress(&m_gatt.connections[conn_index]))
            {
                proxy_pdu_rx_cont(conn_index, p_evt_write->data, p_evt_write->len);
            }
            else
            {
                proxy_pdu_rx_first(conn_index, p_evt_write->data, p_evt_write->len);
            }
        }
        else
        {
            (void) mesh_gatt_disconnect(conn_index);
        }
    }
    else
    {
        // Do Nothing.
    }
}

static void tx_complete_handle(uint16_t conn_handle)
{
    /**
     * NOTE: We're assuming that a successful call to sd_ble_gatts_hvx() means guarantee of
     * delivery. Hence, the TX_COMPLETE event is merely used for flow control.
     */

    uint16_t conn_index = conn_handle_to_index(conn_handle);
    if (conn_index == MESH_GATT_CONN_INDEX_INVALID)
    {
        return;
    }

    mesh_gatt_connection_t * p_conn = &m_gatt.connections[conn_index];
    packet_buffer_packet_t * p_packet = p_conn->tx.transaction.p_curr_packet;

    if (p_packet == NULL)
    {
        /* Some other HVX user transmitted a packet. We don't have anything to send for this
         * connection index, so we'll return here. */
        return;
    }

    mesh_gatt_proxy_buffer_t * p_proxy_buffer = (mesh_gatt_proxy_buffer_t *) p_packet->packet;

    if (tx_transaction_is_complete(p_conn, p_proxy_buffer))
    {
        tx_state_clear(p_conn);

        mesh_gatt_evt_t evt;
        evt.type = MESH_GATT_EVT_TYPE_TX_COMPLETE;
        evt.conn_index = conn_index;
        evt.params.tx_complete.pdu_type = (mesh_gatt_pdu_type_t) ((mesh_gatt_proxy_pdu_t *) p_proxy_buffer->pdu)->pdu_type;
        evt.params.tx_complete.token = p_proxy_buffer->token;

        m_gatt.evt_handler(&evt, m_gatt.p_context);

        if (packet_buffer_can_pop(&p_conn->tx.packet_buffer))
        {
            /* Start transmitting new pdu */
            NRF_MESH_ERROR_CHECK(packet_buffer_pop(&p_conn->tx.packet_buffer,
                                                   &p_conn->tx.transaction.p_curr_packet));
            NRF_MESH_ASSERT(p_conn->tx.transaction.p_curr_packet != NULL);

            mesh_gatt_pdu_send(conn_index);
        }
    }
    else
    {
        mesh_gatt_pdu_send(conn_index);
    }
}

static void disconnect_evt_handle(const ble_evt_t * p_ble_evt)
{
    uint16_t conn_index = conn_handle_to_index(p_ble_evt->evt.gap_evt.conn_handle);
    if (conn_index != MESH_GATT_CONN_INDEX_INVALID)
    {
        conn_index_free(conn_index);

        mesh_gatt_evt_t evt;
        evt.type = MESH_GATT_EVT_TYPE_DISCONNECTED;
        evt.conn_index = conn_index;
        m_gatt.evt_handler(&evt, m_gatt.p_context);
    }
}

static void connect_evt_handle(const ble_evt_t * p_ble_evt)
{
    uint16_t conn_index = conn_index_alloc(p_ble_evt->evt.gap_evt.conn_handle);
    if (conn_index != MESH_GATT_CONN_INDEX_INVALID)
    {
        /* Clear the buffer state. */
        packet_buffer_init(&m_gatt.connections[conn_index].tx.packet_buffer,
                           m_gatt.connections[conn_index].tx.packet_buffer_data,
                           sizeof(m_gatt.connections[conn_index].tx.packet_buffer_data));
        mesh_gatt_evt_t evt;
        evt.type = MESH_GATT_EVT_TYPE_CONNECTED;
        evt.conn_index = conn_index;
        m_gatt.evt_handler(&evt, m_gatt.p_context);
    }
}

static void exchange_mtu_req_handle(const ble_evt_t * p_ble_evt)
{
    uint16_t conn_index = conn_handle_to_index(p_ble_evt->evt.gatts_evt.conn_handle);
    if (conn_index != MESH_GATT_CONN_INDEX_INVALID)
    {
        uint16_t client_rx_mtu = p_ble_evt->evt.gatts_evt.params.exchange_mtu_request.client_rx_mtu;
        uint16_t server_rx_mtu = MAX(MIN(MIN(client_rx_mtu, NRF_SDH_BLE_GATT_MAX_MTU_SIZE),
                                         MESH_GATT_MTU_SIZE_MAX),
                                     BLE_GATT_ATT_MTU_DEFAULT);

        uint32_t status = sd_ble_gatts_exchange_mtu_reply(p_ble_evt->evt.gatts_evt.conn_handle, server_rx_mtu);

        if (status == NRF_SUCCESS)
        {
            m_gatt.connections[conn_index].effective_mtu = server_rx_mtu - MESH_GATT_WRITE_OVERHEAD;
        }
        else
        {
            __LOG(LOG_SRC_INTERNAL,
                  LOG_LEVEL_WARN,
                  "Got %#x on exchange_mtu_reply with client mtu %u and server mtu %u\n",
                  status,
                  client_rx_mtu,
                  server_rx_mtu);
        }
    }
}

/*******************************************************************************
 * Public API
 ******************************************************************************/

void mesh_gatt_init(const mesh_gatt_uuids_t * p_uuids,
                    mesh_gatt_evt_handler_t evt_handler,
                    void * p_context)
{
    NRF_MESH_ASSERT(p_uuids != NULL && evt_handler != NULL);

    for (uint32_t i = 0; i < MESH_GATT_CONNECTION_COUNT_MAX; ++i)
    {
        m_gatt.connections[i].effective_mtu = BLE_GATT_ATT_MTU_DEFAULT - MESH_GATT_WRITE_OVERHEAD;
        m_gatt.connections[i].rx.pdu_type = MESH_GATT_PDU_TYPE_INVALID;
        m_gatt.connections[i].rx.timeout_event.cb = timeout_cb;
        m_gatt.connections[i].rx.timeout_event.p_context = &m_gatt.connections[i];
        m_gatt.connections[i].conn_handle = BLE_CONN_HANDLE_INVALID;
        memset(m_gatt.connections[i].tx.packet_buffer_data,
               0,
               sizeof(m_gatt.connections[i].tx.packet_buffer_data));
        packet_buffer_init(&m_gatt.connections[i].tx.packet_buffer,
                           m_gatt.connections[i].tx.packet_buffer_data,
                           sizeof(m_gatt.connections[i].tx.packet_buffer_data));
    }

    memcpy(&m_gatt.uuids, p_uuids, sizeof(mesh_gatt_uuids_t));
    m_gatt.evt_handler = evt_handler;

    ble_uuid_t uuid = {.type = BLE_UUID_TYPE_BLE, .uuid = p_uuids->service};
    NRF_MESH_ERROR_CHECK(sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY, &uuid, &m_gatt.handles.service));


